Revit 2027 API
ForgeTypeId.GetHashCode Method
 Returns the hash code for this ForgeTypeId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
public:
virtual int GetHashCode() override
abstract GetHashCode : unit -> int
override GetHashCode : unit -> int
Return Value
Int32
 A 32-bit signed integer hash code.
See Also
Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace